Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РегистрСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РегистрСведений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПродажаТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокНоменклатураНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	
	 Если ТекСтрока.Номенклатура = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Цена = ПолучитьЦену(Объект.Дата, ТекСтрока.Номенклатура);
	
	Если Цена <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Количество * Цена;
    КонецЕсли;
КонецПроцедуры
  
  
&НаСервере
Функция ПолучитьЦену(Дата, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегистрСведенийСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.РегистрСведений.СрезПоследних(&Дата, Номенклатура В (&Номенклатура)) КАК РегистрСведенийСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Цена;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	


&НаКлиенте
Процедура СписокНоменклатураКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	Цена = ПолучитьЦену(Объект.Дата, ТекСтрока.Номенклатура);
	Если Цена <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Количество * Цена;
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВыборСрокаГодности(ВыбранныйСрок, ДопПараметры) Экспорт
	Если ВыбранныйСрок = Неопределено Тогда
        Возврат;
	КонецЕсли;
	 ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	 ТекСтрока.СрокГодности = ВыбранныйСрок.СрокГодности;
	
 КонецПроцедуры


&НаКлиенте
 Процедура СписокНоменклатураСрокГодностиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь; 
	 ТекСтрока = Элементы.СписокНоменклатура.ТекущиеДанные;
	 
	 Если ТекСтрока = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", ТекСтрока.Номенклатура);
	Оповещение = Новый ОписаниеОповещения("ВыборСрокаГодности", ЭтотОбъект);
	ОткрытьФорму("Документ.ПродажаТовара.Форма.ФормаСрокГодности", ПараметрыФормы,,,,,Оповещение);
	
 КонецПроцедуры
